set_property IOSTANDARD LVCMOS33 [get_ports b]
set_property IOSTANDARD LVCMOS33 [get_ports a]
set_property IOSTANDARD LVCMOS33 [get_ports y0]
set_property IOSTANDARD LVCMOS33 [get_ports y1]
set_property IOSTANDARD LVCMOS33 [get_ports y2]
set_property IOSTANDARD LVCMOS33 [get_ports y3]
set_property IOSTANDARD LVCMOS33 [get_ports y4]
set_property IOSTANDARD LVCMOS33 [get_ports y5]
set_property IOSTANDARD LVCMOS33 [get_ports y6]
set_property IOSTANDARD LVCMOS33 [get_ports y7]
set_property SLEW SLOW [get_ports y7]
set_property DRIVE 12 [get_ports y7]
set_property PACKAGE_PIN A12 [get_ports y2]
set_property PACKAGE_PIN A13 [get_ports y3]
set_property PACKAGE_PIN A15 [get_ports y4]
set_property PACKAGE_PIN A16 [get_ports y5]
set_property PACKAGE_PIN A17 [get_ports y6]
set_property PACKAGE_PIN A18 [get_ports y7]

create_clock -period 10.000 -name virtual_clock -waveform {0.000 5.000}
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports a]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports a]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y0]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y0]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y1]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y1]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y2]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y2]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y3]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y3]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y5]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y5]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y6]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y6]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y7]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y7]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports b]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports b]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports y4]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports y4]


set_property PACKAGE_PIN D12 [get_ports y1]
set_property PACKAGE_PIN E12 [get_ports y0]
set_property PACKAGE_PIN E13 [get_ports b]
set_property PACKAGE_PIN F13 [get_ports a]

