set_property IOSTANDARD LVCMOS33 [get_ports b]
set_property IOSTANDARD LVCMOS33 [get_ports a]
set_property IOSTANDARD LVCMOS33 [get_ports BUF_gate]
set_property IOSTANDARD LVCMOS33 [get_ports AND_gate]
set_property IOSTANDARD LVCMOS33 [get_ports OR_gate]
set_property IOSTANDARD LVCMOS33 [get_ports XOR_gate]
set_property IOSTANDARD LVCMOS33 [get_ports NOT_gate]
set_property IOSTANDARD LVCMOS33 [get_ports NAND_gate]
set_property IOSTANDARD LVCMOS33 [get_ports NOR_gate]
set_property IOSTANDARD LVCMOS33 [get_ports XNOR_gate]

set_property PACKAGE_PIN AE13 [get_ports OR_gate]
set_property PACKAGE_PIN AJ14 [get_ports XOR_gate]
set_property PACKAGE_PIN AJ15 [get_ports NOT_gate]
set_property PACKAGE_PIN AH13 [get_ports NAND_gate]
set_property PACKAGE_PIN AH14 [get_ports NOR_gate]
set_property PACKAGE_PIN AL12 [get_ports XNOR_gate]

create_clock -period 10.000 -name virtual_clock -waveform {0.000 5.000}
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports a]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports a]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports BUF_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports BUF_gate]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports AND_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports AND_gate]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports OR_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports OR_gate]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports XOR_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports XOR_gate]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports NAND_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports NAND_gate]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports NOR_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports NOR_gate]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports XNOR_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports XNOR_gate]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports b]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports b]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.050 [get_ports NOT_gate]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 0.100 [get_ports NOT_gate]


set_property PACKAGE_PIN AF13 [get_ports AND_gate]
set_property PACKAGE_PIN AG14 [get_ports BUF_gate]
set_property PACKAGE_PIN E13 [get_ports b]
set_property PACKAGE_PIN A13 [get_ports a]
